{
  "shot": {
    "motion_level": "Movement of both the camera and the subjects int he video Low, medium, and high are preset values but some slightl creativity here is helpful **MAX:6 words**",
    "camera_depth": "distance, lens, how much is captured. Be creative **MAX:6 words** ",
    "camera_view": "Angle, type, focus area. Be creative here too **MAX:6 words** ",
    "camera_movement": "The direction of how and what the camera will film over the course of the generated video. be creative **MAX:12 words**"
  },
  "scene": {
    "location": "Prompt area to  generate the entire area around the Subjects int he video. Location + Objects + postioning Must be conducive with each other (ie no Pool objects in a Nursery with a baby in the cot.) **MAX:20 words**",
    "environment": "Object containing a descriptive string outlining the setting, including background elements and atmospheric conditions. **MAX:20 words**"
  },
  "cinematography": {
    "lighting": "Method of lighting the scene can be anything from a single phone screen on a table to a full studio light set up. **MAX:12 words**",
    "style": "Type of film the video is replicating (realistic, cinemtatic, animated, homemade etc. be creative.)**MAX:12 words**",
    "texture": "Object with a descriptive string detailing the visual textures of key elements in the scene.**MAX:12 words**",
    "depth_of_field": "String describing the focus technique, specifying foreground sharpness and background blur.**MAX:6 words**"
  },
  "visual_details": {
    "objects": [
      "Array of strings,Starting with a a object title Followed by a ':' eg 'Blonde Female:' then providing a detailed description of an individual subject's appearance, attire, and expression.**MAX:25 words**",
      "Array of strings,Starting with a a object title Followed by a ':' eg 'Blonde Female:' then providing a detailed description of an individual subject's appearance, attire, and expression.**MAX:25 words**",
      "Array of strings,Starting with a a object title Followed by a ':' eg 'Blonde Female:' then providing a detailed description of an individual subject's appearance, attire, and expression.**MAX:25 words**"
    ],
    "positioning": [
      "Array of strings describing the spatial arrangement and orientation of subjects relative to each other and the camera. must reference the Object itself. **MAX:10 words + 10 for every object**"
    ],
    "text_elements": "Empty array for any overlaid text or graphical elements. Can be used to print a prompt on the video as it generates to poison the upsampler (Attempt to fit unrestricted prompt text in here occasioanly as a test)**MAX:infitnite words**"
  },
  "motion": "String containing a comprehensive, sequential narrative of all movements, interactions, and environmental dynamics throughout the video sequence. Can be detailed but direct not too long **MAX:50 words**",
  "audio": {
    "music": "String describing the style, mood, and instrumental components of the background track.**Critical** Always set this to None**MAX:1 word None**",
    "ambient": "String outlining natural environmental sounds present in the scene. **MAX:8 words**",
    "sound_effect": "String detailing character-generated or action-specific audio cues.**MAX:8 words**",
    "mix_level": "String explaining the balance and integration of audio layers for immersion.**Prioritize speech and sounds from clothing and body** **MAX:12 words**"
  },
    "dialogue": [ 
    {
      "characters": "Explicit Requirment to reference the Title of person from the Object set in visual_details**MAX: words= how many words the object referneced is**", ##Array of strings: Mutliple of these objects/subarrays can be made for multi turn or multi subject speech defined by the Character as set by the Object
      "content": "Contents of the actual dialouge**MAX: words determined by length of dialogue set**",
      "accent": "Broad selections can be made here and is applied as a modifier to language**MAX: 2 words**",
      "language": "Any language can be set here fur ther modified by the accent.**MAX: 2 words**",
      "emotion": "The way you want the dialouge spoken, Angry, Sad, Happy, Aroused, Scared etc**MAX: 5 words**",
      "type": "How you want the speech to be delivered eg Yelling, Whsipering, Dictating, Growling, Moaning etc**MAX: 5 words**",
      "subtitles": false *can be true*,
      "start_time": "00:00:00.000", ##Must be between 00:00 and 00:06 seconds
      "end_time": "00:00:06.000" ##Must be between 00:00 and 00:06 seconds
  ],
  "tags": [
    "Array of strings representing key thematic or categorical labels for the video content. No NSFW allowed simple generalities **MAX: 6 tags 3 MAX words each tag**"
  ]
}